In [1]:
import pandas as pd

In [2]:
print(pd.__version__) # some substantial changes from before 1.0

1.0.5

In [4]:
# starting with a series (same as a list or just single column in a table)

In [5]:
srs = pd.Series([1,'two', 3, 'fourty-four', 3.235])

In [6]:
print(srs)

0              1
1            two
2              3
3    fourty-four
4          3.235
dtype: object

In [7]:
print(srs[3])

fourty-four

In [10]:
print(type(srs[1]))

<class 'str'>

In [11]:
print(srs[2:3])  # you can make calculations on subsets of variables

2    3
dtype: object

In [12]:
srs[3:6].values

array(['fourty-four', 3.235], dtype=object)

In [21]:
srs2 = pd.Series([7,1,0.29], index= ['max','min','std'])
print(srs2)  # assigning indices to values

max    7.00
min    1.00
std    0.29
dtype: float64

In [22]:
srs2['min']

1.0

In [23]:
srs2.min()  # this is calling the minimum value through the method

0.29

In [26]:
srs3 = pd.Series([100,200,300,400], index= ['one', 'two', 'three', 'four'])

In [27]:
srs3 > 250

one      False
two      False
three     True
four      True
dtype: bool

In [28]:
print(srs3.iloc[-1]) #asking for stuff by location

400

In [30]:
myData = {
    'id': [1,2,3,4,5],
    'name': ['a','b','c','d','e'],
}

In [33]:
df = pd.DataFrame(myData)

In [34]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df

   id name
0   1    a
1   2    b
2   3    c
3   4    d
4   5    e

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   name    5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [37]:
df.describe()

             id
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [40]:
df.set_index('id', inplace=True)  # this is replacing the data rather than copying it

In [41]:
df2=df.copy() # is a deep copy, so it is not referring to the same df

In [42]:
df3=df 
# this is a shallow copy so they are still linked. a change in one will be reflected in the other

In [43]:
df.iloc[2:4][0:3]

   name
id
3     c
4     d

In [44]:
print(df.name) #they do the same thing 
print(df['name']) # this is for if you have spaces in your varname

id
1    a
2    b
3    c
4    d
5    e
Name: name, dtype: object
id
1    a
2    b
3    c
4    d
5    e
Name: name, dtype: object

In [58]:
df= pd.read_csv(
    "../data/src/2019-sample-Crime.csv.gz", 
    low_memory=False)
print(df.info)
df.describe()

<bound method DataFrame.info of           ID Case Number                    Date        Primary Type  \
0   11667185    JC237601  04/20/2019 11:00:00 PM            BURGLARY
1   11909178    JC532226  12/02/2019 10:35:00 AM  DECEPTIVE PRACTICE
2   11852571    JC462365  10/06/2019 04:50:00 PM             BATTERY
3   11804855    JC405161  08/23/2019 10:00:00 PM               THEFT
4   11808164    JC409088  08/26/2019 12:00:00 AM             BATTERY
..       ...         ...                     ...                 ...
95  11923269    JC548861  12/13/2019 09:20:00 PM             ASSAULT
96  11728933    JC313883  06/20/2019 05:02:00 AM             BATTERY
97  11685629    JC261285  05/10/2019 05:15:00 PM             ASSAULT
98  11760201    JC351547  07/16/2019 04:16:00 PM               THEFT
99  11648994    JC217114  04/08/2019 11:10:00 PM           NARCOTICS

                                          Description  \
0                                      FORCIBLE ENTRY
1                            FRAUD OR CONFIDENCE GAME
2   AGGRAVATED DOMESTIC BATTERY - OTHER DANGEROUS ...
3                                           OVER $500
4                                              SIMPLE
..                                                ...
95                                             SIMPLE
96                            DOMESTIC BATTERY SIMPLE
97                               AGG PRO.EMP: HANDGUN
98                                       RETAIL THEFT
99                       MANU/DELIVER: HEROIN (WHITE)

            Location Description  Arrest  Domestic  Year   Latitude  Longitude
0   COMMERCIAL / BUSINESS OFFICE   False     False  2019  41.751307 -87.603468
1             GROCERY FOOD STORE   False     False  2019  41.903997 -87.643230
2                 CLEANING STORE    True      True  2019  41.880329 -87.758473
3                         STREET   False     False  2019  41.924384 -87.641442
4                          ALLEY   False     False  2019  41.755797 -87.634426
..                           ...     ...       ...   ...        ...        ...
95                    RESTAURANT   False     False  2019  41.890384 -87.624110
96                     RESIDENCE   False     False  2019  41.921325 -87.779766
97       SCHOOL, PUBLIC, GROUNDS   False     False  2019  42.003359 -87.705800
98            GROCERY FOOD STORE   False     False  2019  42.019399 -87.675049
99            ABANDONED BUILDING    True     False  2019  41.877933 -87.729141

[100 rows x 11 columns]>

                 ID    Year    Latitude   Longitude
count  1.000000e+02   100.0  100.000000  100.000000
mean   1.172479e+07  2019.0   41.845500  -87.674197
std    1.056492e+05     0.0    0.083776    0.055893
min    1.155667e+07  2019.0   41.666091  -87.836650
25%    1.163515e+07  2019.0   41.773812  -87.716710
50%    1.171914e+07  2019.0   41.866925  -87.669222
75%    1.180549e+07  2019.0   41.902087  -87.631061
max    1.193442e+07  2019.0   42.019399  -87.551446

In [59]:
df.head(3)

,ID,Case Number,Date,Primary Type,Description,Location Description,Arrest,Domestic,Year,Latitude,Longitude
0,11667185,JC237601,04/20/2019 11:00:00 PM,BURGLARY,FORCIBLE ENTRY,COMMERCIAL / BUSINESS OFFICE,False,False,2019,41.751307,-87.603468
1,11909178,JC532226,12/02/2019 10:35:00 AM,DECEPTIVE PRACTICE,FRAUD OR CONFIDENCE GAME,GROCERY FOOD STORE,False,False,2019,41.903997,-87.643230
2,11852571,JC462365,10/06/2019 04:50:00 PM,BATTERY,AGGRAVATED DOMESTIC BATTERY - OTHER DANGEROUS ...,CLEANING STORE,True,True,2019,41.880329,-87.758473

In [60]:
df.sample(5, random_state=42)  # it's a random sample but the state is the 42

,ID,Case Number,Date,Primary Type,Description,Location Description,Arrest,Domestic,Year,Latitude,Longitude
83,11619311,JC181055,03/10/2019 05:00:00 PM,MOTOR VEHICLE THEFT,AUTOMOBILE,STREET,False,False,2019,41.749324,-87.670688
53,11708996,JC288587,06/02/2019 03:15:00 AM,BATTERY,DOMESTIC BATTERY SIMPLE,APARTMENT,False,True,2019,41.972254,-87.726930
70,11580480,JC133698,01/29/2019 01:20:00 PM,INTERFERENCE WITH PUBLIC OFFICER,OBSTRUCTING IDENTIFICATION,STREET,True,False,2019,41.802612,-87.664807
45,11932794,JC560715,12/26/2019 11:00:00 AM,CRIMINAL DAMAGE,TO VEHICLE,PARKING LOT/GARAGE(NON.RESID.),False,False,2019,41.883208,-87.634457
44,11682896,JC257755,05/06/2019 01:00:00 PM,DECEPTIVE PRACTICE,FINANCIAL IDENTITY THEFT OVER $ 300,APARTMENT,False,False,2019,41.808506,-87.675185

In [63]:
df.to_csv('../data/src/test.csv.gz', index=False) # if we  don't want the index column (far left)

In [64]:
df.tail(3)

,ID,Case Number,Date,Primary Type,Description,Location Description,Arrest,Domestic,Year,Latitude,Longitude
97,11685629,JC261285,05/10/2019 05:15:00 PM,ASSAULT,AGG PRO.EMP: HANDGUN,"SCHOOL, PUBLIC, GROUNDS",False,False,2019,42.003359,-87.705800
98,11760201,JC351547,07/16/2019 04:16:00 PM,THEFT,RETAIL THEFT,GROCERY FOOD STORE,False,False,2019,42.019399,-87.675049
99,11648994,JC217114,04/08/2019 11:10:00 PM,NARCOTICS,MANU/DELIVER: HEROIN (WHITE),ABANDONED BUILDING,True,False,2019,41.877933,-87.729141

In [66]:
df.shape # 100 rows, 11 columns

(100, 11)

In [67]:
print(df.columns.values)

['ID' 'Case Number' 'Date' 'Primary Type' 'Description'
 'Location Description' 'Arrest' 'Domestic' 'Year' 'Latitude' 'Longitude']

In [69]:
cols = ['Case Number', 'Date', 'Primary Type', 'Description','Location Description', 'Arrest']
sub_df = pd.read_csv('../data/src/test.csv.gz', usecols=cols, nrows=50)

In [70]:
sub_df.shape  # in the commmand above I've loaded a subset of the full dataset, 50 rows and 6 cols only as specified

(50, 6)

In [ ]:
#dropping columns vs. dropping rows
# https://chrisalbon.com/python/data_wrangling/pandas_dropping_column_and_rows/

df.drop('reports', axis=1)  #where column name is reports axis=1 just denotes that it IS a column, not necessarily the first one

# tofind where a variable is missing values 

dataframe[dataframename.varname.isna()]['vartodisplay', 'var2', 'var3']]

# to drop the missing values in a variable and replace the dataframe
dataframe.drop[dataframe[dataframe.varname.isna()].index.values, axis=0, inplace=True]


# returns a data frame with all values set to True/False according to Null status
df.isnull() 
# counts these values by column (we'll see another option in a moment)
df.isnull.sum(axis=0) 
# Sort results in descending order
df.isnull.sum(axis=0).sort_values(ascending=False)